{
    "PT": {
        "subtitle": "Desenvolvedor Java Spring, Bacharelado em Sistemas de Informação",
        "sobre": "Na Meta, contribuí significativamente para o desenvolvimento de produtos SAP, utilizando linguagem ABAP e aprimorando interfaces com o uso de Fiori Elements e S/4HANA. Minha abordagem ao desenvolvimento Restful com SAP RAP e manipulação de dados em XML e DDL, juntamente com a criação de relatórios ALV e CDS Views, reflete meu compromisso com a excelência e a inovação. Atualmente, estou focando em uma carreira como desenvolvedor fullstack Java, sou graduado a nível bacharelado em Sistemas de Informação na Unipar, o que tem aprimorado minha habilidade em programação orientada a objetos, e trabalhando como freelancer em projetos pessoais acabei aprimorando minhas habilidades em tecnologias web como Java Spring e React.JS, a busca constante por conhecimento e a proatividade em resolver problemas complexos são o motor que impulsiona minha carreira na área de TI, foco em desenvolver projetos fullstack e trabalhar no front e back de cada projeto para maximizar meu aprendizado em desenvolvimento de sistemas e segurança dos mesmos.",
        "arraste": "Arraste para ver mais",
        "col-md-8_h3": "Densenvolvedor de Software",
        "bacharel": "Bacharel de Sistemas de Informação - UNIPAR - Umuarama - PR",
        "list-group-item": "Nascimento",
        "birthday": "01 de Julho de 2003",
        "list-group-item-age": "Idade",
        "cidade": "Cidade",
        "estado": "Estado",
        "list-group-item-universidade": "Universidade",
        "span-universidade": "Unipar - Umuarama - Sistemas de Informação",
        "historico": "Trabalhei na area como estágiario remoto desenvolvedor de software SAP ABAP na <a href='https://www.meta.com.br/' target='_blank'>Meta Serviços em Informatica</a> , autalmente estou migrando para carreira de desenvolvedor Java Spring.",
        "habilidades": "Todas as habilidades que adquiri na pratica através de cursos, minha faculdade de sistemas ou até mesmo em projetos pessoais que comprovam as habilidades abaixo, em que os mesmos estão todos no meu Github.",
        "curriculo": "Currículo",
        "educacao": "Educação",
        "curso": "Bacharelado de Sistemas de Informação",
        "ano": "2021 - 2024",
        "uni": "Unipar - Universidade Paranaense",
        "descricao-curso": "O bacharel em Sistemas de Informação me deu conceitos e muito aprendizado e prática em desenvolvemento, manutenção e admnistração de sistemas.",
        "robotica": "Robótica com Arduino",
        "happycode": "Happy Code  - Umuarama",
        "sobre-robotica": "O meu primeiro contato oficial com a programação foi com a Happy Code Umuarama, escola de programação onde faziamos o curso de Róbotica com arduino e desnevolviamos varios projetos na prática com a linguagem C++.",
        "experiencia": "Experiências",
        "estagio": "Estágiario de desenvolvimento SAP ABAP.",
        "tempo": "jun - 2023 até dez - 2023",
        "estagio_descr": "Na Meta, contribuí significativamente para o desenvolvimento de produtos SAP, utilizando linguagem ABAP e aprimorando interfaces com o uso de Fiori Elements e S/4HANA. Minha abordagem ao desenvolvimento Restful com SAP RAP e manipulação de dados em XML e DDL, juntamente com a criação de relatórios ALV e CDS Views, reflete meu compromisso com a excelência e a inovação.",
        "prof": "Professor de Informática Básica",
        "prof_descr": "Associação de Assistência aos Surdos de Umuarama.",
        "contato": "Contato",
        "local": "Localização"
    },

    "EN": {
        "subtitle": "Java Spring Developer, Bachelor's Degree in Information Systems",
        "sobre": "At Meta, I made significant contributions to the development of SAP products, utilizing ABAP language and enhancing interfaces using Fiori Elements and S/4HANA. My approach to Restful development with SAP RAP and data manipulation in XML and DDL, along with the creation of ALV reports and CDS Views, reflects my commitment to excellence and innovation. Currently, I am focusing on a career as a fullstack Java developer, I have a bachelor's degree in Information Systems from Unipar, which has improved my object-oriented programming skills, and working as a freelancer on personal projects has enhanced my skills in web technologies such as Java Spring and React.JS. The constant pursuit of knowledge and proactivity in solving complex problems are the driving force behind my career in IT. I focus on developing fullstack projects and working on both the front and back end of each project to maximize my learning in system development and security.",
        "arraste": "Drag to see more",
        "col-md-8_h3": "Software Developer",
        "bacharel": "Bachelor's Degree in Information Systems - UNIPAR - Umuarama - PR",
        "list-group-item": "Birth",
        "birthday": "July 1st, 2003",
        "list-group-item-age": "Age",
        "cidade": "City",
        "estado": "State",
        "list-group-item-universidade": "University",
        "span-universidade": "Unipar - Umuarama - Information Systems",
        "historico": "I worked in the area as a remote software development intern at <a href='https://www.meta.com.br' target='_blank'/>Meta Serviços em Informatica</a>, currently I am migrating to a career as a Java Spring developer.",
        "habilidades": "All the skills I acquired in practice through courses, my information systems college or even in personal projects that prove the skills below, all of which are on my Github.",
        "curriculo": "Resume",
        "educacao": "Education",
        "curso": "Bachelor's Degree in Information Systems",
        "ano": "2021 - 2024",
        "uni": "Unipar - Universidade Paranaense",
        "descricao-curso": "The bachelor's degree in Information Systems gave me concepts and a lot of learning and practice in development, maintenance, and administration of systems."
    }
}